{
	"version": "https://jsonfeed.org/version/1",
	"title": "Earnestly Developing",
	"icon": "https://micro.blog/earnestly/avatar.jpg",
	"home_page_url": "https://earnestly.dev/",
	"feed_url": "https://earnestly.dev/feed.json",
	"items": [
		
			{
				"id": "http://earnestly.micro.blog/2023/07/23/pithy-panda.html",
				"title": "Pithy Panda",
				"content_html": "<p>I spent 30 days in June working on ROAST NOTES. I posted (nearly) daily updates. I got a lot of things working, and learned what it’d take to finish up the initial MVP. I learned a little bit more about how I’m interested in spending my time. After finishing the 30 day challenge, I took a step back. I faltered and languished. Summer things happened and I lost the momentum I’d started to build the month prior. But I did keep listening to my regular rotation of startup/side hustle related podcasts. One episode in particular struck a chord.</p>\n<hr>\n<p>Some of the first things I ran into when thinking about Earnestly was various success stories with people building drop shipping businesses. It seemed like something that’d be interesting to experiment with and learn about, and I spent a little time investigating some options but wasn’t able to find anything that really resonated with me.</p>\n<p>Until that aforementioned podcast episode.</p>\n<p>Print on demand (POD) is a form of drop shipping. You setup a website/store, collect orders, and a third party prints the item(s) and delivers them to the customer.</p>\n<p>Something about that podcast episode made me think … I could design some simple t-shirts, and try to sell them via a POD partner. But there was this little thing called ROAST NOTES that I needed to finish first - right?</p>\n<p>I wavered for a bit on this point. It’s important to finish what you’ve started, and I’ve already <a href=\"https://earnestly.dev/2023/06/02/day-more-updates.html\">pivoted</a> once so it’d be bad form to pivot or pause again … or would it?</p>\n<hr>\n<p>In the end I decided a few things.</p>\n<ul>\n<li>This is my business/venture and I can do what I want to with it. There’s no boss to appease or board to convince that I should do something different.</li>\n<li>Whatever the specifics of what I’ll end up building, the overarching goal of the whole thing is to try to build small things. Even if they fail I’ll still learn something.</li>\n<li>In order for ROAST NOTES (or anything else) to succeed, I’m going to have to market/advertise it before anyone can find it. If I have to learn how to do this while also keeping it running, that might not be the most ideal use of my time.</li>\n<li>I think t-shirts are fun (I probably wear more t-shirts than any other type of shirt).</li>\n</ul>\n<hr>\n<p>I’m pausing work on ROAST NOTES to work on <a href=\"https://linkpop.com/pithypanda\">Pithy Panda</a>. The business part of selling POD t-shirts will require less manual work to keep things moving than ROAST NOTES would, freeing me to focus on learning how to build an audience/customer base. Those skills will be useful whenever I return to ROAST NOTES or try the next thing.</p>\n<hr>\n<p>What do you think? Should I have pushed ROAST NOTES across the finish line? Will it be harder than I think to sell POD t-shirts?</p>\n",
				"content_text": "I spent 30 days in June working on ROAST NOTES. I posted (nearly) daily updates. I got a lot of things working, and learned what it’d take to finish up the initial MVP. I learned a little bit more about how I’m interested in spending my time. After finishing the 30 day challenge, I took a step back. I faltered and languished. Summer things happened and I lost the momentum I’d started to build the month prior. But I did keep listening to my regular rotation of startup/side hustle related podcasts. One episode in particular struck a chord. \r\n\r\n---\r\n\r\nSome of the first things I ran into when thinking about Earnestly was various success stories with people building drop shipping businesses. It seemed like something that’d be interesting to experiment with and learn about, and I spent a little time investigating some options but wasn’t able to find anything that really resonated with me. \r\n\r\nUntil that aforementioned podcast episode.\r\n\r\nPrint on demand (POD) is a form of drop shipping. You setup a website/store, collect orders, and a third party prints the item(s) and delivers them to the customer.\r\n\r\nSomething about that podcast episode made me think … I could design some simple t-shirts, and try to sell them via a POD partner. But there was this little thing called ROAST NOTES that I needed to finish first - right?\r\n\r\nI wavered for a bit on this point. It’s important to finish what you’ve started, and I’ve already [pivoted](https://earnestly.dev/2023/06/02/day-more-updates.html) once so it’d be bad form to pivot or pause again … or would it? \r\n\r\n---\r\n\r\nIn the end I decided a few things.\r\n\r\n- This is my business/venture and I can do what I want to with it. There’s no boss to appease or board to convince that I should do something different.\r\n- Whatever the specifics of what I’ll end up building, the overarching goal of the whole thing is to try to build small things. Even if they fail I’ll still learn something.\r\n- In order for ROAST NOTES (or anything else) to succeed, I’m going to have to market/advertise it before anyone can find it. If I have to learn how to do this while also keeping it running, that might not be the most ideal use of my time.\r\n- I think t-shirts are fun (I probably wear more t-shirts than any other type of shirt).\r\n\r\n---\r\n\r\nI’m pausing work on ROAST NOTES to work on [Pithy Panda](https://linkpop.com/pithypanda). The business part of selling POD t-shirts will require less manual work to keep things moving than ROAST NOTES would, freeing me to focus on learning how to build an audience/customer base. Those skills will be useful whenever I return to ROAST NOTES or try the next thing. \r\n\r\n---\r\n\r\nWhat do you think? Should I have pushed ROAST NOTES across the finish line? Will it be harder than I think to sell POD t-shirts?\n",
				"date_published": "2023-07-23T15:43:41-05:00",
				"url": "https://earnestly.dev/2023/07/23/pithy-panda.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/30/day-challenge-final.html",
				"title": "30 Day Challenge: Final Reflection",
				"content_html": "<p>Day 30/30: Today marks the 30th and final day of this 30 day challenge. It’s been a good way to focus my time over the past month. Before waxing about what I’ve learned over the challenge, how far did the challenge get me?</p>\n<p>In short, if this was a single piece of software I was versioning, it’d get an <em>alpha</em> label at this point. Everything that I think is needed is there, but there’s a fair bit of testing that’s needed. In this case it’s largely integration testing - how do all of the individual parts play together? Does it make sense for me as the maintainer? Will it make sense to users?</p>\n<p>In other words, not so bad Charlie Brown, not so bad. I’m happy with what the renewed focus has helped me accomplish.</p>\n<hr>\n<p>What else have I learned? <a href=\"https://earnestly.dev/2023/06/15/day-half-way.html\">Last time</a> I wrote about 3 things that were more philosophical in nature:</p>\n<ol>\n<li>Some Time is Better Than No Time</li>\n<li>Consistency Builds Momentum</li>\n<li>The Software Is Easy</li>\n</ol>\n<p>As I reflect on the challenge as a whole, those things still stand, but the past week or so I feel like I’ve been learning more tactical/technical things. In no particular order:</p>\n<ul>\n<li>Airtable data modeling: I <a href=\"https://earnestly.dev/2023/06/20/day-its-possible.html\">realized</a> that I was overthinking things. Fortunately it wasn’t too far gone and I was able to straighten things out the <a href=\"https://earnestly.dev/2023/06/21/day-after-stepping.html\">next day</a>. Lesson learned: keep it simple (and live within the constraints of the no-code tool).</li>\n<li>Make integrations: As a developer I’m intimately familiar with making REST API calls directly. I’ve been using <a href=\"https://www.make.com/\">Make</a> as the way to tie things together, and thanks to the collection of integrations they support, making a handful of API calls was as easy as dragging/dropping a few things in their scenario builder. After <a href=\"https://earnestly.dev/2023/06/27/days-ive-had.html\">finding</a> what ended up being a bug in the Shippo API I was able to dig deeper into some of those calls using some of their tooling to inspect the request/response objects.</li>\n<li>Shippo: After the aforementioned bug with the Shippo API, I had to do a little more digging/learning about how orders and shipments work in their system. Since I’m starting this out with a lot of manual processing, I don’t have a “store” to integrate with their system (and don’t want to use or build one). After digging around a bit I think I’ve got a handle on things. I’m going to live with the bug in their API (it’ll be fixed eventually) and just manually update the information that’s not making it through.</li>\n<li>USPS Shipping: This is still something I need to do a little more learning on, but as I get closer to launching this thing out there I’ve had to learn more about the ins and outs of USPS shipping rates. Coming up on my TODO list is probably a trip to my local post office to ask them a few questions to confirm what I’ve been reading.</li>\n</ul>\n<hr>\n<p>When I <a href=\"https://earnestly.dev/2023/03/01/im-officially-kicking.html\">first officially started</a> Earnestly Developing there was still a part of me trying to figure out exactly what it is I want to do. I figured out enough to get started, but the end destination was still a little murky. It still is, but I’ve gained a little bit of clarity over the past week or so.</p>\n<ol>\n<li>I’m more interested in building some small side hustles with passive income than building something with the intention of it becoming a full time thing. Of course if any of these take off unexpectedly I’m happy to revisit this :-)</li>\n<li>I’m more interested in “doing the work” than “writing about the work”. There’s a bit of tension held here, because “writing about the work” is the primary way I’m planning to help people find out about what I’m building. I don’t think I’m going to stop writing about it, but I’m going to try to shift (if even just mentally) where the balance is between the two.</li>\n</ol>\n<hr>\n<p>So what does the next 30 days hold? Time will tell, but I won’t necessarily be posting daily updates as formally as I have been. I’m going to try to continue the momentum of making daily small steps, but might try to consolidate progress updates to once or twice a week.</p>\n<p>As far as what’s next for ROAST NOTES? Lots of that integration testing I mentioned up top. And marketing. Gotta figure out where the coffee roasting people are hanging out and how to let them know about this without being pushy/annoying about it.</p>\n",
				"content_text": "Day 30/30: Today marks the 30th and final day of this 30 day challenge. It’s been a good way to focus my time over the past month. Before waxing about what I’ve learned over the challenge, how far did the challenge get me? \r\n\r\nIn short, if this was a single piece of software I was versioning, it’d get an *alpha* label at this point. Everything that I think is needed is there, but there’s a fair bit of testing that’s needed. In this case it’s largely integration testing - how do all of the individual parts play together? Does it make sense for me as the maintainer? Will it make sense to users?\r\n\r\nIn other words, not so bad Charlie Brown, not so bad. I’m happy with what the renewed focus has helped me accomplish.\r\n\r\n---\r\n\r\nWhat else have I learned? [Last time](https://earnestly.dev/2023/06/15/day-half-way.html) I wrote about 3 things that were more philosophical in nature:\r\n\r\n1. Some Time is Better Than No Time\r\n2. Consistency Builds Momentum\r\n3. The Software Is Easy\r\n\r\nAs I reflect on the challenge as a whole, those things still stand, but the past week or so I feel like I’ve been learning more tactical/technical things. In no particular order:\r\n\r\n- Airtable data modeling: I [realized](https://earnestly.dev/2023/06/20/day-its-possible.html) that I was overthinking things. Fortunately it wasn’t too far gone and I was able to straighten things out the [next day](https://earnestly.dev/2023/06/21/day-after-stepping.html). Lesson learned: keep it simple (and live within the constraints of the no-code tool).\r\n- Make integrations: As a developer I’m intimately familiar with making REST API calls directly. I’ve been using [Make](https://www.make.com/) as the way to tie things together, and thanks to the collection of integrations they support, making a handful of API calls was as easy as dragging/dropping a few things in their scenario builder. After [finding](https://earnestly.dev/2023/06/27/days-ive-had.html) what ended up being a bug in the Shippo API I was able to dig deeper into some of those calls using some of their tooling to inspect the request/response objects.\r\n- Shippo: After the aforementioned bug with the Shippo API, I had to do a little more digging/learning about how orders and shipments work in their system. Since I’m starting this out with a lot of manual processing, I don’t have a “store” to integrate with their system (and don’t want to use or build one). After digging around a bit I think I’ve got a handle on things. I’m going to live with the bug in their API (it’ll be fixed eventually) and just manually update the information that’s not making it through.\r\n- USPS Shipping: This is still something I need to do a little more learning on, but as I get closer to launching this thing out there I’ve had to learn more about the ins and outs of USPS shipping rates. Coming up on my TODO list is probably a trip to my local post office to ask them a few questions to confirm what I’ve been reading.\r\n\r\n---\r\n\r\nWhen I [first officially started](https://earnestly.dev/2023/03/01/im-officially-kicking.html) Earnestly Developing there was still a part of me trying to figure out exactly what it is I want to do. I figured out enough to get started, but the end destination was still a little murky. It still is, but I’ve gained a little bit of clarity over the past week or so.\r\n\r\n1. I’m more interested in building some small side hustles with passive income than building something with the intention of it becoming a full time thing. Of course if any of these take off unexpectedly I’m happy to revisit this :-) \r\n2. I’m more interested in “doing the work” than “writing about the work”. There’s a bit of tension held here, because “writing about the work” is the primary way I’m planning to help people find out about what I’m building. I don’t think I’m going to stop writing about it, but I’m going to try to shift (if even just mentally) where the balance is between the two.\r\n\r\n---\r\n\r\nSo what does the next 30 days hold? Time will tell, but I won’t necessarily be posting daily updates as formally as I have been. I’m going to try to continue the momentum of making daily small steps, but might try to consolidate progress updates to once or twice a week. \r\n\r\nAs far as what’s next for ROAST NOTES? Lots of that integration testing I mentioned up top. And marketing. Gotta figure out where the coffee roasting people are hanging out and how to let them know about this without being pushy/annoying about it.\n",
				"date_published": "2023-06-30T17:43:23-05:00",
				"url": "https://earnestly.dev/2023/06/30/day-challenge-final.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/29/day-today-has.html",
				
				"content_html": "<p>Day 29/30: Today has been a bit of <a href=\"https://en.wiktionary.org/wiki/yak_shaving\">yak shaving</a> on my <a href=\"https://earnestly.dev\">blog</a> triggered by an unintentional update of the theme I was using. I&rsquo;d been thinking about changing it up anyways and starting to post longer updates here instead of Substack, so it was time well spent.</p>\n<p>Shoutout to <a href=\"https://micro.blog/mtt\">@Mtt</a> for the excellent <a href=\"http://tinyformicro.blog\">Tiny Theme</a> that I&rsquo;m now using.</p>\n",
				"content_text": "Day 29/30: Today has been a bit of [yak shaving](https://en.wiktionary.org/wiki/yak_shaving) on my [blog](https://earnestly.dev) triggered by an unintentional update of the theme I was using. I'd been thinking about changing it up anyways and starting to post longer updates here instead of Substack, so it was time well spent.\n\nShoutout to [@Mtt](https://micro.blog/mtt) for the excellent [Tiny Theme](http://tinyformicro.blog) that I'm now using.\n",
				"date_published": "2023-06-29T16:37:21-05:00",
				"url": "https://earnestly.dev/2023/06/29/day-today-has.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/28/day-a-productive.html",
				
				"content_html": "<p>Day 28/30: a productive afternoon:</p>\n<ul>\n<li>created email templates in MailerSend needed throughout the workflow</li>\n<li>revisited the Stripe payment link I created a while back (I think it&rsquo;s good to go)</li>\n<li>dug into various aspects of shipping, think I have a good plan</li>\n<li>started to sketch out a final punchlist</li>\n</ul>\n",
				"content_text": "Day 28/30: a productive afternoon:\r\n\r\n- created email templates in MailerSend needed throughout the workflow\r\n- revisited the Stripe payment link I created a while back (I think it's good to go)\r\n- dug into various aspects of shipping, think I have a good plan\r\n- started to sketch out a final punchlist\n",
				"date_published": "2023-06-28T20:34:52-05:00",
				"url": "https://earnestly.dev/2023/06/28/day-a-productive.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/27/days-ive-had.html",
				
				"content_html": "<p>Days 23-27/30: I&rsquo;ve had a bit of a slow spot in this 30 day challenge - just too many other things going on. Regardless &hellip;</p>\n<p>I was able to do a little debugging of the issue between Make and Shippo and open a ticket with Shippo after verifying the API request/response from Make. Turns out there&rsquo;s a bug in the API, they suggested an alternate endpoint as a workaround (the one I was using is still in beta).</p>\n<p>I think I&rsquo;m just about at the point of making a final punchlist before calling this ready.</p>\n",
				"content_text": "Days 23-27/30: I've had a bit of a slow spot in this 30 day challenge - just too many other things going on. Regardless ... \r\n\r\nI was able to do a little debugging of the issue between Make and Shippo and open a ticket with Shippo after verifying the API request/response from Make. Turns out there's a bug in the API, they suggested an alternate endpoint as a workaround (the one I was using is still in beta). \r\n\r\nI think I'm just about at the point of making a final punchlist before calling this ready. \n",
				"date_published": "2023-06-27T20:43:54-05:00",
				"url": "https://earnestly.dev/2023/06/27/days-ive-had.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/22/day-tonight-was.html",
				
				"content_html": "<p>Day 22/30: Tonight was about getting an integration from Airtable to Shippo via Make. I&rsquo;ve got all of the correct fields from Airtable now, but am having some issues with Shippo not wanting to use the sender address. Not sure if it&rsquo;s a Make issue or a Shippo issue.</p>\n",
				"content_text": "Day 22/30: Tonight was about getting an integration from Airtable to Shippo via Make. I've got all of the correct fields from Airtable now, but am having some issues with Shippo not wanting to use the sender address. Not sure if it's a Make issue or a Shippo issue.\n",
				"date_published": "2023-06-22T20:42:22-05:00",
				"url": "https://earnestly.dev/2023/06/22/day-tonight-was.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/21/day-after-stepping.html",
				
				"content_html": "<p>Day 21/30: After stepping back and thinking through what data I need where, I&rsquo;ve untangled the mess I made in Airtable. The Softr UI is wired back up to everything correctly, and I believe I&rsquo;ve got all of the individual fields that I need for Shippo.</p>\n",
				"content_text": "Day 21/30: After stepping back and thinking through what data I need where, I've untangled the mess I made in Airtable. The Softr UI is wired back up to everything correctly, and I believe I've got all of the individual fields that I need for Shippo.\n",
				"date_published": "2023-06-21T21:34:22-05:00",
				"url": "https://earnestly.dev/2023/06/21/day-after-stepping.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/20/day-its-possible.html",
				
				"content_html": "<p>Day 20/30: it&rsquo;s possible that I&rsquo;ve overcomplicated the schema in my Airtable. I think I&rsquo;ve undone a few degrees of complexity - still need to rethink what that means for what I can use on Softr.</p>\n<p>I mostly like no-code, but sometimes it seems like it&rsquo;d be easier if I wasn&rsquo;t bound by its constraints.</p>\n",
				"content_text": "Day 20/30: it's possible that I've overcomplicated the schema in my Airtable. I think I've undone a few degrees of complexity - still need to rethink what that means for what I can use on Softr. \r\n\r\nI mostly like no-code, but sometimes it seems like it'd be easier if I wasn't bound by its constraints.\n",
				"date_published": "2023-06-20T21:22:18-05:00",
				"url": "https://earnestly.dev/2023/06/20/day-its-possible.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/19/days-the-weekend.html",
				
				"content_html": "<p>Days 17-19/30: the weekend got away from me a bit. Over the past few days I realized the way I was storing addresses (in a single field) won&rsquo;t work for the Shippo API (obvious in hindsight). I&rsquo;ve been doing a little work in Airtable to fix this which has trickled into some updates in Softr.</p>\n",
				"content_text": "Days 17-19/30: the weekend got away from me a bit. Over the past few days I realized the way I was storing addresses (in a single field) won't work for the Shippo API (obvious in hindsight). I've been doing a little work in Airtable to fix this which has trickled into some updates in Softr.\n",
				"date_published": "2023-06-19T21:40:18-05:00",
				"url": "https://earnestly.dev/2023/06/19/days-the-weekend.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/16/day-today-was.html",
				
				"content_html": "<p>Day 16/30: Today was one of those days that fits in the <a href=\"https://earnestlydeveloping.substack.com/i/128650655/some-time-is-better-than-no-time\">some time is better than no time</a> category. Spent a little bit of time playing with Mailersend which I&rsquo;m planning to use for transactional emails.</p>\n",
				"content_text": "Day 16/30: Today was one of those days that fits in the [some time is better than no time](https://earnestlydeveloping.substack.com/i/128650655/some-time-is-better-than-no-time) category. Spent a little bit of time playing with Mailersend which I'm planning to use for transactional emails.\n",
				"date_published": "2023-06-16T22:24:32-05:00",
				"url": "https://earnestly.dev/2023/06/16/day-today-was.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/15/day-half-way.html",
				
				"content_html": "<p>Day 15/30: Half way through. I&rsquo;ve learned 3 things so far:</p>\n<ul>\n<li>Some Time is Better Than No Time</li>\n<li>Consistency Builds Momentum</li>\n<li>The Software Is Easy</li>\n</ul>\n<p><a href=\"https://earnestlydeveloping.substack.com/p/30-day-challenge-first-half?sd=pf\">earnestlydeveloping.substack.com/p/30-day-&hellip;</a></p>\n",
				"content_text": "Day 15/30: Half way through. I've learned 3 things so far:\n\n- Some Time is Better Than No Time\n- Consistency Builds Momentum\n- The Software Is Easy\n\n[earnestlydeveloping.substack.com/p/30-day-...](https://earnestlydeveloping.substack.com/p/30-day-challenge-first-half?sd=pf)\n",
				"date_published": "2023-06-15T20:22:14-05:00",
				"url": "https://earnestly.dev/2023/06/15/day-half-way.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/14/day-with-the.html",
				
				"content_html": "<p>Day 14/30: With the core functionality on the website done I&rsquo;ve turned my attention to some of the other backend processes - specifically shipping and transactional emails. I&rsquo;ll write some more in a few days after I&rsquo;ve settled on an initial plan.</p>\n",
				"content_text": "Day 14/30: With the core functionality on the website done I've turned my attention to some of the other backend processes - specifically shipping and transactional emails. I'll write some more in a few days after I've settled on an initial plan.\n",
				"date_published": "2023-06-14T21:10:43-05:00",
				"url": "https://earnestly.dev/2023/06/14/day-with-the.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/13/day-got-an.html",
				
				"content_html": "<p>Day 13/30: Got an earlier start today instead of cramming some work in at the end of the day 💪🏼. I&rsquo;ve got all of the data bits wired into the UI. I&rsquo;m sure that I&rsquo;ll make some small tweaks later but the core functionality is there so I&rsquo;m moving onto shipping labels.</p>\n",
				"content_text": "Day 13/30: Got an earlier start today instead of cramming some work in at the end of the day 💪🏼. I've got all of the data bits wired into the UI. I'm sure that I'll make some small tweaks later but the core functionality is there so I'm moving onto shipping labels.\n",
				"date_published": "2023-06-13T08:08:30-05:00",
				"url": "https://earnestly.dev/2023/06/13/day-got-an.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/12/day-getting-closer.html",
				
				"content_html": "<p>Day 11/30 &amp; 12/30: Getting closer on the functionality to allow logged in users track their exchanges. I&rsquo;m using Softr as the no-code tool for the front end, and it&rsquo;s somewhat simple in how/what it can display. It took a little while figuring out what I can do on the Softr side vs what I need to do in Airtable. I&rsquo;ve taken the tact of trying to get everything I need to display in Softr into a single table in Airtable. I think Airtable is able to manage more complex relationships, and it makes it simpler to simply display whats needed in Softr.</p>\n",
				"content_text": "Day 11/30 & 12/30: Getting closer on the functionality to allow logged in users track their exchanges. I'm using Softr as the no-code tool for the front end, and it's somewhat simple in how/what it can display. It took a little while figuring out what I can do on the Softr side vs what I need to do in Airtable. I've taken the tact of trying to get everything I need to display in Softr into a single table in Airtable. I think Airtable is able to manage more complex relationships, and it makes it simpler to simply display whats needed in Softr.\n",
				"date_published": "2023-06-12T22:36:04-05:00",
				"url": "https://earnestly.dev/2023/06/12/day-getting-closer.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/10/day-almost-done.html",
				
				"content_html": "<p>Day 10/30: Almost (?) done with the refactoring to support user accounts. All of the login flows are done, but I still need to sort out some details with what users can see/do after they&rsquo;ve registered for a coffee exchange.</p>\n",
				"content_text": "Day 10/30: Almost (?) done with the refactoring to support user accounts. All of the login flows are done, but I still need to sort out some details with what users can see/do after they've registered for a coffee exchange.\n",
				"date_published": "2023-06-10T21:06:00-05:00",
				"url": "https://earnestly.dev/2023/06/10/day-almost-done.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/09/day-i-made.html",
				
				"content_html": "<p>Day 8/30: I made a <em>tiny</em> bit of progress on the refactor to enable users to create an account at signup.\nDay 9/30: I&rsquo;ve made some more significant progress on this refactor. I think the Airtable updates have been all made, but now I&rsquo;m working through updates on the Softr side.</p>\n",
				"content_text": "Day 8/30: I made a _tiny_ bit of progress on the refactor to enable users to create an account at signup.\r\nDay 9/30: I've made some more significant progress on this refactor. I think the Airtable updates have been all made, but now I'm working through updates on the Softr side.\n",
				"date_published": "2023-06-09T21:50:35-05:00",
				"url": "https://earnestly.dev/2023/06/09/day-i-made.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/07/day-i-decided.html",
				
				"content_html": "<p>Day 7/30: I decided I do want to have users create an account when they signup. This will enable an easy way for them to be able to view the status of their exchange - so is worth the slight complexity and time of redoing a few things with my Airtable schema.</p>\n",
				"content_text": "Day 7/30: I decided I do want to have users create an account when they signup. This will enable an easy way for them to be able to view the status of their exchange - so is worth the slight complexity and time of redoing a few things with my Airtable schema.\n",
				"date_published": "2023-06-07T21:39:30-05:00",
				"url": "https://earnestly.dev/2023/06/07/day-i-decided.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/06/day-finished-up.html",
				
				"content_html": "<p>Day 6/30: finished up the integration from Airtable to MailerLite w/Make - pretty smooth going (I&rsquo;m sure there&rsquo;ll be some small tweaks I&rsquo;ll make b/f going live). I&rsquo;ve been reconsidering whether I want to create user accounts when people sign up (vs just emailing them transaction details). 🤔</p>\n",
				"content_text": "Day 6/30: finished up the integration from Airtable to MailerLite w/Make - pretty smooth going (I'm sure there'll be some small tweaks I'll make b/f going live). I've been reconsidering whether I want to create user accounts when people sign up (vs just emailing them transaction details). 🤔\n",
				"date_published": "2023-06-06T21:23:11-05:00",
				"url": "https://earnestly.dev/2023/06/06/day-finished-up.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/05/day-forgot-to.html",
				
				"content_html": "<p>Day 4/30: forgot to post an update here - I added a confirmation page for the signup process.\nDay 5/30: started working on a Make integration between Airtable and Mailerlite to add ROAST NOTES roasters to a mailing list after they signup.</p>\n",
				"content_text": "Day 4/30: forgot to post an update here - I added a confirmation page for the signup process.\r\nDay 5/30: started working on a Make integration between Airtable and Mailerlite to add ROAST NOTES roasters to a mailing list after they signup.\n",
				"date_published": "2023-06-05T21:51:52-05:00",
				"url": "https://earnestly.dev/2023/06/05/day-forgot-to.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/03/day-i-wrote.html",
				
				"content_html": "<p>Day 3/30: I wrote about some of the details behind the pivot of ROAST NOTES. It&rsquo;s ok to change direction. Going light and lean this time around.\n<a href=\"https://earnestlydeveloping.substack.com/p/30-day-challenge-june?sd=pf\">earnestlydeveloping.substack.com/p/30-day-&hellip;</a></p>\n",
				"content_text": "Day 3/30: I wrote about some of the details behind the pivot of ROAST NOTES. It's ok to change direction. Going light and lean this time around.\r\n[earnestlydeveloping.substack.com/p/30-day-...](https://earnestlydeveloping.substack.com/p/30-day-challenge-june?sd=pf)\n",
				"date_published": "2023-06-03T09:03:11-05:00",
				"url": "https://earnestly.dev/2023/06/03/day-i-wrote.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/02/day-more-updates.html",
				
				"content_html": "<p>Day 2/30: more updates to the ROAST NOTES landing page – it&rsquo;s about ready to go.</p>\n<p>A few weeks ago I pivoted from the original idea for RN. I liked what I&rsquo;d built, but wasn&rsquo;t convinced it was something I&rsquo;d use or pay for.</p>\n<p>The new idea: a simple way to exchange my roasts with other home roasters.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Day 2/30: more updates to the ROAST NOTES landing page – it's about ready to go.\r\n\r\nA few weeks ago I pivoted from the original idea for RN. I liked what I'd built, but wasn't convinced it was something I'd use or pay for.\r\n\r\nThe new idea: a simple way to exchange my roasts with other home roasters.\n\n<img src=\"https://cdn.uploads.micro.blog/98895/2023/4cd6deb6e8.png\" width=\"600\" height=\"233\" alt=\"\">\n",
				"date_published": "2023-06-02T08:07:14-05:00",
				"url": "https://earnestly.dev/2023/06/02/day-more-updates.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/06/01/to-kick-start.html",
				
				"content_html": "<p>To kick start things back into gear I&rsquo;m doing a 30 day challenge through the month of June: spend at least an hour doing something for Earnestly each day and post something about it. Today: updates to the new ROAST NOTES app. More details tomorrow.</p>\n",
				"content_text": "To kick start things back into gear I'm doing a 30 day challenge through the month of June: spend at least an hour doing something for Earnestly each day and post something about it. Today: updates to the new ROAST NOTES app. More details tomorrow.\n",
				"date_published": "2023-06-01T21:08:10-05:00",
				"url": "https://earnestly.dev/2023/06/01/to-kick-start.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/03/19/spent-some-time.html",
				
				"content_html": "<p>Spent some time this past week finalizing the launch page for ROAST NOTES - an upcoming tool for home coffee roasters. Now to finish up the app and get it launched!</p>\n<p><a href=\"https://roastnotes.app\">roastnotes.app</a></p>\n",
				"content_text": "Spent some time this past week finalizing the launch page for ROAST NOTES - an upcoming tool for home coffee roasters. Now to finish up the app and get it launched!\r\n\r\n[roastnotes.app](https://roastnotes.app)\n",
				"date_published": "2023-03-19T20:48:20-05:00",
				"url": "https://earnestly.dev/2023/03/19/spent-some-time.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/03/19/taking-things-one.html",
				
				"content_html": "<p>Taking things one step at a time (even if slower than anticipated) is still good progress.</p>\n<p><a href=\"https://earnestlydeveloping.substack.com/p/small-things?sd=pf\">earnestlydeveloping.substack.com/p/small-t&hellip;</a></p>\n",
				"content_text": "Taking things one step at a time (even if slower than anticipated) is still good progress.\r\n\r\n[earnestlydeveloping.substack.com/p/small-t...](https://earnestlydeveloping.substack.com/p/small-things?sd=pf)\n",
				"date_published": "2023-03-19T20:47:14-05:00",
				"url": "https://earnestly.dev/2023/03/19/taking-things-one.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/03/08/no-offense-to.html",
				
				"content_html": "<p>No offense to Tom Petty, but sometimes it&rsquo;s the starting that&rsquo;s the hardest part.</p>\n<p><a href=\"https://earnestlydeveloping.substack.com/p/on-starting?sd=pf\">On Starting</a></p>\n",
				"content_text": "No offense to Tom Petty, but sometimes it's the starting that's the hardest part.\n\n[On Starting](https://earnestlydeveloping.substack.com/p/on-starting?sd=pf)\n",
				"date_published": "2023-03-08T22:29:52-05:00",
				"url": "https://earnestly.dev/2023/03/08/no-offense-to.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/03/01/im-officially-kicking.html",
				
				"content_html": "<p>I&rsquo;m officially kicking of Earnestly Developing today! I&rsquo;ve written a short post outlining what I&rsquo;m planning to do. Follow along for regular updates.</p>\n<p><a href=\"https://open.substack.com/pub/earnestlydeveloping/p/hello-world?r=8col9&amp;utm_campaign=post&amp;utm_medium=web\">Hello World</a></p>\n",
				"content_text": "I'm officially kicking of Earnestly Developing today! I've written a short post outlining what I'm planning to do. Follow along for regular updates.\r\n\r\n[Hello World](https://open.substack.com/pub/earnestlydeveloping/p/hello-world?r=8col9&utm_campaign=post&utm_medium=web)\n",
				"date_published": "2023-03-01T16:31:02-05:00",
				"url": "https://earnestly.dev/2023/03/01/im-officially-kicking.html"
			},
			{
				"id": "http://earnestly.micro.blog/2023/01/31/excited-to-get.html",
				
				"content_html": "<p>Excited to get started Earnestly Developing this year. More details coming soon!</p>\n",
				"content_text": "Excited to get started Earnestly Developing this year. More details coming soon!\n",
				"date_published": "2023-01-31T21:34:54-05:00",
				"url": "https://earnestly.dev/2023/01/31/excited-to-get.html"
			}
	]
}
